module.exports = {
	DEBUG: false,
	CONFIG:{
        init:{
            money: 5000, // 初始资金
            image: 0, // 初始形象值
			workerCount: 2, // 初始工人数量
			humanResourcePoint: 2000, // 初始人力资源点数
			roomResourcePoint: 0, // 初始房间资源点数
			roomType: 0, // 初始房间类型
			roomBasicImage: 0, // 初始房间基础形象
			randomOtherMoney: [10000,40000], // 其他公司初始资金随机范围
			randomOtherImage: [500,3000], // 其他公司初始形象随机范围
			roomPower: 1000, // 第一个房间的初始电力
			roomDurab: 0, // 第一个房间的初始耐久
			roomRisk: 2, // 第一个房间的初始风险等级
			roomAuto: 0, // 第一个房间的初始自动化程度
			roomLevel: 1, // 第一个房间的初始等级
			randomOtherRoomRange: [3,5], // 其他公司初始房间数量随机范围
			randmOtherRoomPowerRange: [50,10000], // 其他公司初始房间电力随机范围
			randmOtherRoomDurabRange: [0,7000], // 其他公司初始房间耐久随机范围
			randmOtherRoomRiskRange: [2,2], // 其他公司初始房间风险等级随机范围
			randmOtherRoomAutoRange: [0,10000], // 其他公司初始房间自动化随机范围
			randmOtherRoomLevelRange: [1,3], // 其他公司初始房间等级随机范围
			terminalDurab: 0, // 终端机初始耐久
			terminalPowerLevel: 1, // 终端机初始供电等级
			terminalDigLevel: 1, // 终端机初始挖矿等级
			terminalTradeLevel: 1, // 终端机初始交易等级
        },
        namespace: { // 名字空间
            common: ['热','马','湖','金','大','美','腾','万','奇','育','小','福','田','新','宇','通','长','尚','仁','德','成','恒','亚','雅','卓','星','宝','牛','飞','西','龙','合','世','界','曲','文','花','华','庆','丰','中','北','南','东','苏','资','耀','光','雷','民','银','宜','日','维','林','生','电','联','古','宫','鸿','宏','吉','基','蓝','百','顺','多','利','立','力','丽','特','矿','春','法','京','紫','井','汇','河','山','江','泽','科','柯','邦','意','奥','晨','知','达','英','阳','洋','喜','飞','三','五','八','九','洲','申','谷','内','渚','尔','太','空','全','托','思','速','道','艾','嘉','索','天','风','云','贵','米','明','网','讯','狗','昆','财','富','复','莱','能','语','射','重','辉','惠','慧','韩','涵','唐','堂','老','岚','漫','泉','加','它','安','鲁','香','凡','秋','夏','渡','千','朝','乐','贤','如','雪','学','上','本','秀','汉','菲','普','瑞','悦','钢','铁','荣','一','康','加','佳','领','尼','格','杰','洛','凡','艺','燕','国','果','简','建','宁','巨','菊','聚','章','城','雄','登','图','途','昂','海','黑','和','知','直','深','鱼','舒','露','真','众','想','初','车','保','晓','门','心','鼎','定','丁','宾','体','永','旺','平','品','朋','岛','友','优','麦','崇','围','伟','卫','松','孙','角','莎','梦','皇','环','欧','典','卡','酷','展','强','媒','甲','怡','外'],
            factory: ['集团','集团','集团','集团','集团','控股','控股','控股','控股','控股','控股','股份','产业','重工','科技','传媒','文化','能源','贸易','工厂'],
            room: ['街','街','街','街','街','街','街','街','街','街','街','街','街','街','街','路','路','路','路','路','路','路','路','路','路','路','路','路','路','路','路','区','区','区','区','区','区','区','区','区','区','区','区','区','区','区','区','镇','镇','镇','镇','桥','桥','桥','桥','桥','坡','塘','屯','坟','冲','园','院','铺','庄','山','津','湾','地','城','村','署','台','广场','广场','广场','广场','广场','广场','公园','公园','公园','公园','公园','公园','大道','大学','公寓','大厦','商区','工区','小区'],
            worker1: ['赵','赵','赵','赵','赵','赵','赵','赵','赵','赵','赵','钱','钱','钱','钱','钱','孙','孙','孙','孙','孙','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','李','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','周','吴','吴','吴','吴','吴','吴','郑','郑','郑','郑','郑','郑','郑','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','王','冯','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','陈','方','方','方','范','范','范','范','范','褚','卫','蒋','蒋','蒋','蒋','蒋','沈','沈','沈','沈','沈','沈','沈','韩','韩','韩','韩','韩','韩','韩','韩','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','杨','朱','朱','朱','朱','朱','朱','秦','秦','秦','秦','秦','尤','许','许','许','许','许','许','许','何','何','何','何','何','吕','吕','吕','吕','吕','施','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','张','孔','孔','孔','曹','曹','曹','曹','曹','严','华','金','金','金','魏','魏','陶','陶','姜','姜','戚','谢','谢','谢','邹','喻','柏','水','窦','章','云','苏','潘','潘','潘','潘','葛','奚','彭','彭','彭','彭','彭','郎','鲁','韦','昌','马','马','马','马','马','马','马','苗','苗','凤','花','方','俞','任','任','任','任','袁','袁','袁','袁','袁','柳','酆','鲍','史','唐','唐','唐','唐','唐','唐','唐','唐','唐','唐','唐','费','廉','岑','薛','薛','薛','雷','贺','贺','贺','贺','贺','倪','汤','滕','殷','罗','罗','罗','罗','罗','罗','毕','郝','邬','安','常','乐','于','时','傅','皮','卞','齐','康','伍','余','元','卜','顾','顾','顾','顾','孟','平','黄','黄','黄','黄','黄','黄','和','穆','萧','尹','姚','姚','姚','姚','姚','姚','邵','湛','汪','汪','汪','汪','祁','毛','毛','毛','毛','毛','禹','狄','米','贝','明','臧','计','伏','成','戴','戴','戴','戴','戴','戴','谈','宋','宋','宋','宋','宋','宋','宋','宋','宋','茅','庞','庞','庞','熊','纪','舒','舒','舒','舒','屈','项','祝','董','董','董','董','董','梁','梁','梁','梁','杜','杜','杜','杜','杜','阮','蓝','闵','席','季','麻','强','贾','路','娄','危','江','江','江','江','江','江','江','江','江','江','江','童','童','童','颜','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','郭','梅','盛','林','林','林','林','林','林','林','林','林','林','林','林','林','林','林','林','林','刁','钟','徐','徐','徐','徐','徐','徐','徐','徐','邱','邱','骆','高','高','夏','夏','夏','夏','夏','夏','夏','蔡','蔡','蔡','蔡','蔡','蔡','田','樊','胡','胡','胡','胡','胡','胡','胡','凌','霍','虞','万','支','柯','昝','管','卢','莫','莫','莫','莫','经','房','裘','缪','干','解','应','宗','丁','宣','贲','邓','邓','邓','邓','邓','邓','郁','单','杭','洪','包','诸','左','石','崔','吉','钮','龚','程','嵇','邢','滑','裴','陆','陆','陆','陆','陆','陆','陆','陆','陆','荣','翁','荀','羊','於','惠','甄','曲','家','封','芮','羿','储','靳','汲','邴','糜','松','井','段','富','巫','乌','焦','巴','弓','牧','隗','山','谷','车','侯','宓','蓬','全','郗','班','仰','秋','仲','伊','宫','宁','仇','栾','暴','甘','钭','厉','戎','祖','武','符','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','刘','景','詹','束','龙','龙','龙','叶','幸','司','韶','郜','黎','蓟','薄','印','宿','白','怀','蒲','邰','从','鄂','索','咸','籍','赖','卓','蔺','屠','蒙','池','乔','阴','鬱','胥','能','苍','双','闻','莘','党','翟','谭','贡','劳','逄','姬','申','扶','堵','冉','宰','郦','雍','卻','璩','桑','桂','濮','牛','寿','通','边','扈','燕','冀','郏','浦','尚','农','温','别','庄','晏','柴','瞿','阎','充','慕','连','茹','习','宦','艾','鱼','容','向','古','易','易','易','易','易','易','易','慎','戈','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','廖','庾','终','暨','居','衡','步','都','耿','满','弘','匡','国','文','寇','广','禄','阙','东','欧','殳','沃','利','蔚','越','夔','隆','欧阳','欧阳','欧阳','欧阳','欧阳','欧阳','上官','慕容','司马','皇甫','东方','夏侯','公孙','司徒','轩辕','令狐','漆雕','淳于','宇文'],
            worker2: ['良','姮','娥','大','秋','莲','犹','嘉','懿','有','曼','凝','翟','芷','蝶','少','雪','枫','洋','以','松','裘','雨','竹','关','烨','姜','叶','帆','玄','冰','菱','隽','嘉','颖','中','瑞','渊','勇','贞','羿','名','姝','郸','华','皓','歌','韵','麴','秋','露','闵','意','蕴','景','晨','风','占','丹','云','招','优','扬','庞','如','云','昌','小','凝','师','碧','灵','依','丽','娜','位','寒','梅','皇','甫','向','南','豆','孟','夙','寄','南','铎','桂','帆','剧','德','明','业','基','李','吉','月','尹','思','萱','九','恬','雅','蒿','烨','煜','都','晴','岚','卫','丹','方','访','冬','光','盼','晴','欧','梦','蕊','勤','苓','公','羊','清','懿','韦','清','宁','肥','馨','荣','酒','素','昕','爱','凝','海','詹','思','枫','海','文','静','晋','觅','柔','仇','余','妍','陶','维','路','晶','辉','贸','听','枫','祢','歌','吹','郝','念','念','潮','祺','褚','迎','彤','简','梦','安','甘','妙','菡','居','觉','濮','和','顺','洛','虹','雨','定','森','谷','凝','旋','桑','高','爽','皮','优','乐','法','琼','贵','曼','妮','瑞','念','露','宁','衍','鲍','语','山','彤','昌','明','雁','卉','公','孙','天','纵','笪','璧','郁','绍','祺','焦','书','双','硕','水','风','折','柔','怀','田','雅','达','系','又','松','凌','雯','华','戢','雁','凡','蒲','贞','芳','乾','雅','艳','京','逸','致','寇','滨','买','泽','飞','梦','华','鄢','安','琪','卜','淡','羊','芮','美','花','晨','希','白','飞','双','坚','夏','山','季','叶','冼','元','绿','乘','澄','邈','隆','飞','鸿','字','馨','昔','海','女','公','良','端','懿','阙','献','仪','苗','澍','史','听','筠','丙','丹','烟','求','盼','晴','俞','野','云','谌','和','平','虞','语','风','营','恨','风','董','痴','春','黄','秋','巧','春','致','萱','沙','梦','山','考','妮','娜','计','问','玉','闭','紫','丝','韶','芸','熙','本','凌','雪','马','明','远','宰','慕','山','敖','元','龙','漆','雕','谷','蕊','谭','飞','柏','蚁','夏','旋','邢','文','瑶','禚','语','燕','贯','修','永','沃','雄','班','飞','莲','昂','今','支','静','珊','紫','伟','兆','文','超','竺','傲','丝','倪','婉','清','鹿','千','柔','储','安','静','肇','乐','康','针','铄','赖','智','美','蹇','闳','佘','碧','灵','任','友','菱','堵','如','心','鞠','思','远','贺','语','蓉','那','焱','柳','晶','霞','颛','孙','喜','悦','宜','孟','阳','独','春','海','仆','元','瑶','局','之','桃','回','哲','茂','卢','傲','云','板','雪','羽','山','元','化','祈','秋','柔','公','叔','欣','笑','柏','理','赫','连','运','诚','舒','澈','孔','彤','霞','吕','依','美','亓','元','灵','前','姿','华','曜','坤','淳','于','悦','远','亥','冬','卉','褒','楠','端','忆','南','扬','莘','莘','尾','浩','邈','第','诗','丹','檀','星','汉','宗','晓','丝','奉','涵','映','易','静','白','苑','平','和','其','半','凡','多','语','海','蒋','秋','荷','佴','水','冷','倚','廖','妙','珍','太','史','合','美','锺','英','卓','允','采','枫','潭','飞','兰','操','慧','英','钮','冠','扶','敏','智','夕','雨','竹','菅','弘','深','用','善','思','虢','舒','兰','武','之','卉','磨','正','志','翁','灵','波','诸','飞','丹','夏','侯','俊','才','司','寇','清','淑','睢','朵','儿','答','昆','鹏','森','飞','瑶','巧','浩','宕','狂','阳','朔','代','楠','楠','泰','念','双','柯','博','简','公','西','红','旭','丑','德','本','朱','华','晖','委','玥','纳','雪','松','仁','思','溪','巢','智','志','甫','安','荷','全','星','厍','隽','雅','綦','歌','云','柔','旭','鹏','仵','和','韵','轩','辕','英','华','秘','妙','晴','喻','飞','燕','家','晏','旅','白','亦','孟','映','阳','老','咏','志','市','山','蝶','卿','泰','和','党','芷','雪','妫','梅','雪','穆','明','达','城','菀','容','洁','接','安','怡','霍','秀','艳','休','范','明','张','如','礼','尔','竹','费','丰','旷','为','梁','丘','采','枫','原','越','彬','环','凡','之','苏','冷','雪','锺','离','瑜','威','梦','兰','镜','亦','绿','毓','涵','畅','但','可','佳','淦','丽','泽','刑','清','晖','乌','雅','向','卉','图','门','语','芹','桐','月','朗','种','怀','玉','星','灵','秀','励','芳','泽','孝','晶','瑶','涂','乐','然','单','白','莲','塞','梦','秋','藤','代','桃','谬','绿','蓉','束','昕','雨','鄂','宛','筠','畅','庄','雅','卑','晶','灵','石','乐','水','嵇','慕','梅','毕','茂','才','逄','曼','寒','闻','人','幻','露','南','晨','轩','侍','夏','烟','蒙','朝','安','濮','骑','歌','飞','赤','紫','琼','尧','幼','枫','楼','玉','英','达','亘','郦','天','菱','军','志','用','时','浩','瀚','茂','莹','何','天','空','墨','从','霜','福','晏','如','行','烨','烁','丹','阳','波','沐','央','荆','雪','卉','让','信','然','府','咸','谏','轩','秀','卞','和','怡','植','逸','云','裔','秋','白','俎','谷','梦','蔚','静','婉','智','暮','芸','郜','悠','雅','苦','宏','峻','呼','延','艺','乜','元','枫','商','绮','兰','慕','清','漪','生','长','逸','怀','琼','华','督','琴','心','公','涵','阳','兴','方','方','勾','辰','沛','迟','雅','丽','弥','刚','毅','咸','涵','易','长','友','槐','徭','芳','春','红','运','凯','隐','念','珍','牟','冷','亦','不','夏','彤','瓮','婷','玉','牧','腾','骏','乔','唱','月','保','燕','楠','贲','亦','玉','枝','舒','荣','潜','和','志','禽','慧','俊','典','暄','美','酆','良','骥','风','半','烟','布','初','南','覃','惜','赛','慧','美','闾','康','成','刁','兴','怀','徐','彭','湃','边','燕','婉','经','康','顺','德','伟','毅','清','好','洁','梁','海','融','宇','以','莲','毛','叡','姓','清','佳','晁','灵','波','谷','梁','莹','琇','胥','南','风','律','歌','别','才','良','荣','冰','之','邗','萍','韵','斯','学','林','左','新','蕾','郎','祯','萨','璎','逯','梓','露','强','听','春','侨','家','璩','华','奥','曲','纵','臧','南','烟','车','从','冬','佼','凯','凯','岑','含','蕊','邛','秀','妮','岳','如','曼','万','桃','相','曼','彤','纵','雅','静','慕','容','宏','伯','尤','芬','栋','灵','寒','古','晤','宓','芬','馥','吴','诗','珊','实','志','泽','敏','成','双','频','悦','人','子','车','皎','洁','喜','烨','然','桂','天','禄','靖','世','通','向','薇','凤','天','恩','融','嘉','怡','井','芳','洁','燕','隽','俊','茂','慕','梅','萧','香','薇','修','子','濯','野','弘','图','掌','梦','竹','庚','河','漫','司','邓','玉','泉','吉','秋','珊','冉','以','蕊','士','芳','润','潘','通','运','侬','止','明','喆','言','建','本','牛','寻','桃','狄','怜','双','载','良','钭','布','侬','朋','代','卉','兰','雨','文','尚','辰','良','殳','书','兰','宇','文','半','安','丁','夫','检','智','敏','佟','从','蓉','江','佳','蒉','奇','迈','庾','妙','蓬','访','冬','理','若','薇','道','寻','雪','辜','晓','灵','西','门','彬','彬','盘','梓','珊','乙','忻','畅','奕','寒','云','钞','翠','丝','钊','彦','露','游','竹','悦','邰','雍','苌','绮','彤','东','门','初','夏','资','沛','珊','陀','雪','翎','抗','怀','梦','杜','慧','盍','觅','翠','改','妙','春','伊','洲','巫','清','卓','嘉','正','豪','禾','安','珊','斋','嘉','歆','邸','旷','程','痴','梅','澹','台','傲','白','泷','善','芳','迮','文','丽','问','德','运','荀','英','勋','天','晶','滢','锐','琦','巧','拜','依','云','阿','寄','波','邝','碧','菡','贾','曾','双','中','震','奚','山','兰','弘','雅','丽','顿','兴','昌','合','书','慧','晏','以','珊','亢','海','凡','银','雅','琴','施','康','裕','从','星','儿','宛','小','淡','琳','溪','熊','书','文','謇','辰','钊','祝','半','莲','昝','会','捷','含','海','籍','程','霜','昂','杰','席','虹','影','崇','景','中','黎','小','之','闽','令','秋','艾','晓','莉','树','悠','逸','帅','光','辉','虎','雅','懿','辉','惜','玉','仲','驰','皓','完','颜','笛','康','智','伟','汲','修','筠','绍','璇','玑','圭','彩','静','厚','子','民','召','梓','倩','澄','合','瑞','太','叔','阳','泽','秋','秀','曼','夷','冬','卉','念','凡','巧','赧','修','真','司','孤','容','夫','琰','习','逸','思','仰','冰','枫','蒯','从','霜','帛','雪','曼','藩','寄','灵','贝','素','华','邱','冷','之','姒','业','随','正','文','韩','玄','静','严','颖','初','孙','淳','雅','邬','瑜','藏','安','柏','漆','昊','明','靳','乐','容','咎','曲','静','六','曼','吟','普','孤','风','衡','醉','波','势','凝','竹','禹','仪','文','栗','秋','翠','逢','清','漪','谯','白','梦','台','懿','丰','又','晴','戎','晓','筠','平','蕙','若','司','空','觅','云','闳','沙','可','黎','所','如','冬','斐','笑','天','闾','丘','觅','兆','奇','水','东','方','曼','雁','粟','梦','槐','盈','涵','易','亓','官','涵','桃','铁','映','庄','嘉','怡','杞','澜','谢','雅','琴','镇','成','弘','扈','醉','蝶','盖','问','芙','拓','跋','寄','蕾','危','娴','曹','雪','珍','犁','昊','磊','伟','华','彩','温','淑','婉','羊','舌','香','莲','泉','平','心','毋','筠','溪','宗','政','觅','山','訾','丽','君','叶','贤','惠','于','鸿','晖','宰','父','乐','安','说','昊','穹','钦','芳','馨','宦','依','柔','告','文','斌','慎','清','涵','碧','宏','远','次','铭','晨','溥','昊','空','鱼','骊','泓','况','艳','卉','来','星','渊','许','枫','唐','嘉','实','养','艳','蕙','香','晗','琴','谈','冷','珍','廉','梦','凡','千','流','婉','於','爽','盛','旋','桓','寄','翠','郏','韵','磬','蓟','瑜','蓓','驹','新','之','卓','紫','夏','祁','姣','姣','弭','问','香','张','简','依','白','繁','水','晶','马','佳','义','骆','晴','画','延','梓','涵','始','霞','绮','薄','宛','白','忻','芮','波','宋','乐','山','完','雪','晴','楚','心','远','戴','坚','成','及','亦','云','罗','思','凡','奈','嘉','淑','须','忆','安','南','门','泰','孛','沛','蓝','速','羲','同','举','宿','恨','云','笃','韶','容','解','骏','祥','塔','祯','展','谷','玉','穰','星','爵','诗','浩','博','乌','雅','蕊','辛','馨','香','端','木','半','兰','夏','寻','双','余','晓','夏','杭','沛','凝','寒','海','蓝','洪','宏','邈','利','霞','英','青','正','祥','濮','阳','远','航','权','和','硕','伦','月','朗','僧','艳','蕊','吾','音','巨','骥','嬴','紫','桐','素','和','暖','力','怀','慕','丛','婉','君','邹','君','昊','庆','秋','门','语','蕊','浮','桂','芝','寻','雅','艳','莫','悦','媛','望','新','之','林','致','远','陆','靖','荷','娄','灵','卉','在','志','明','竭','依','波','将','冬','梅','袁','尹','蔡','津','隗','芸','鲜','芊','丽','彭','凡','桃','才','齐','永','舒','云','牵','依','白','钟','离','德','惠','源','弘','致','仍','琼','音','冠','文','惠','宫','半','雪','申','屠','雅','云','碧','鲁','红','英','米','侠','骞','却','春','华','初','莞','尔','进','芸','馨','陈','骏','之','初','之','呼','书','桃','巩','沛','泣','瑰','玮','胡','飞','跃','屈','梅','花','伯','惜','珊','悟','彤','上','官','芷','容','伏','代','秋','肖','睿','才','衣','碧','螺','慈','昭','懿','麻','又','蓝','牢','景','山','饶','浩','阔','宣','修','为','撒','淑','贞','仙','寄','柔','泥','明','知','终','慧','丽','阴','宏','硕','堂','靖','巧','御','秀','逸','印','觅','丹','成','丝','微','贰','力','夫','留','余','馥','禄','映','雪','乐','惜','珊','南','宫','晓','山','茆','飞','松','戈','杰','函','悠','奕','巫','马','绮','南','眭','悌','过','馨','香','侯','清','华','芒','雅','韶','浦','文','华','以','书','意','首','初','翠','税','芳','泽','屠','俊','晤','性','杉','郑','凯','康','荤','英','逸','宾','湛','玉','石','续','韵','苟','芷','兰','帖','天','韵','高','鸿','文','年','竹','寸','运','浩','僪','林','愚','妙','芙','万','俟','暄','嫣','微','生','湘','云','益','棠','房','小','珍','稽','春','竹','朴','望','汝','格','格','剑','采','珊','鲁','飞','绿','冒','梦','凡','诸','葛','铃','连','捷','琦','锦','凡','那','拉','子','实','悉','松','月','单','于','寒','天','尔','以','晴','五','正','阳','腾','烨','殷','娜','步','哲','瀚','义','问','管','又','琴','闪','安','竹','鸿','朗','满','婷','秀','伍','星','火','沈','绮','丽','拱','天','蓝','度','可','心','幸','夜','天','壬','晨','星','练','恨','风','池','珠','星','傅','新','立','学','雪','卉','冀','丹','雪','琴','宛','妙','樊','鸿','达','郗','菡','查','苑','杰','仪','冰','彦','费','莫','子','悦','线','飞','雨','范','曜','桥','秋','春','祭','东','茹','思','迪','尉','迟','清','懿','后','英','光','归','利','凭','仲','舒','姚','盼','夏','公','冶','英','耀','校','慧','晨','卷','芳','蕙','广','又','菡','百','雪','萍','丘','怜','南','齐','晶','晶','辟','香','馨','登','凡','双','革','绮','怀','金','良','工','暴','沙','羽','由','运','晟','长','孙','展','错','布','凡','衷','问','风','闻','涵','菡','尉','晓','博','燕','向','松','项','天','元','聂','胤','舜','平','春','雍','天','骄','粘','力','言','章','清','馨','焉','端','静','包','华','采','果','漠','称','美','华','申','璞','玉','段','浩','然','卯','北','嘉','龚','白','翠','睦','萦','心','仲','孙','向','荣','应','月','杉','张','廖','纶','夹','谷','悦','翠','康','胜','开','娴','婉','揭','叶','芳','纳','喇','白','竹','雷','醉','香','滑','依','云','真','静','枫','偶','碧','巧','薛','爵','茅','雅','爱','冯','自','珍','羽','菁','段','干','寒','常','蓓','蕾','己','问','蕊','庹','曜','文','善','俊','能','佟','佳','珂','东','晴','霞','集','书','蝶','曾','婵','娟','寿','慧','丽','疏','依','波','锁','融','乐','正','祺','福','出','问','风','务','香','岚','叔','代','巧','柴','韶','敏','厉','美','丽','是','佳','惠','秦','山','雁','绪','倚','云','圣','冷','云','白','枫','纪','晓','桐','化','藉','汗','凝','莲','建','晴','美','空','翠','柏','第','五','飞','鸾','充','浩','慨','阚','孟','君','友','天','骄','顾','木','烟','晨','旭','龙','念','之','崔','凝','蝶','介','婉','慧','希','奇','玮','能','静','秀','令','莎','莉','脱','溪','儿','巴','阳','辉','蹉','清','妍','机','彩','阳','高','谊','敛','杨','佛','骞','魁','守','傲','玉','诺','嘉','珍','苍','凌','兰'],
        },
		risk_name_map: ['平稳','常规','冒险'], // 风险类别名称
		job_name_map: ['-','发电','挖矿','交易','终端维护','自动化','房间维护','管理员','门面','人力搜索','房间搜索','形象总代言','外交','间谍'], // 职能类别名称
		room_type_name_map: ['通用房','发电站','挖矿厂','交易所'], // 房间类型名称
		randomRoomBasicImageProb: 25, // 其他公司初始房间拥有基础形象概率
        max_durab: 10000, // 最大老化值
        max_balance: 100, // 房间最大平衡值
        max_auto: 10000, // 房间最大自动化值
        max_basicImage: 120, // 房间最大基础门面
        max_room_level: 3, // 最大房间等级
        max_terminal_level: 3, // 最大终端等级
        terminal_count_distribution: [6,8,10], // 房间每级终端数量
        max_power_level: 3, // 终端最高供电等级
        max_dig_level: 3, // 终端最高挖矿等级
        max_trade_level: 3, // 终端最高交易等级
        room_levelup_cost: [20000,30000], // 房间升级费用
        power_levelup_cost: [3000,5000], // 供电等级升级费用
        dig_levelup_cost: [3000,5000], // 挖矿等级升级费用
        trade_levelup_cost: [3000,5000], // 交易等级升级费用
		sell_factor: .5, // 贩卖系数
		randmNewRoomDurabRange: [0,6000], // 新生成房间老化化随机范围
		randmNewRoomAutoRange: [0,0], // 新生成房间自动化随机范围

		searchRoomPointCost: 1000, // 一个房间的搜索点数花费
		seachRoomPointAcc: 10, // 房间搜索花费累加值
		searchWorkerPointCost: 1000, // 一个人员的搜索点数花费
		seachWorkerPointAcc: 10, // 人员搜索花费累加值

		max_support: 10000, // 最大支持点数
		invest_support_threshold: 3000, // 投资支持率阈值
		steal_worker_support_threshold: 5000, // 偷取人员支持率阈值
		steal_worker_support_cost: 5000, // 偷取人员支持率消耗
		steal_room_support_threshold: 7000, // 偷取房间支持率阈值
		steal_room_support_cost: 7000, // 偷取房间支持率消耗
		buy_factory_support_threshold: 0, // 收购工厂支持率阈值
		image_price_factor: .2, // 形象/价值系数

		damage_money_cost: 500000, // 一次形象破坏资金消耗
		saction_money_cost: 500000, // 经济打压最低投入金额

		max_image_prop_money: 10000, // 形象宣传投入资金最大值
		image_prop_factor: .001, // 形象宣传提升形象系数

		days_limit_range: [800,900,1000,1000,1000,1000], // 时间限制范围

		terminal: {
			base: 1.5,
			power_factor: .3,
			durab_increase: 25,
			dig_factor: .3,
			dig_power_consume_base: 40,
			dig_power_consume_factor: 40,
			trade_money_factor: .25,
			trade_support_factor: .01,
			trade_power_consume_base: 40,
			trade_power_consume_factor: 40,
			durab_threshold: 5000,
			durab_factor: 1.8,
			durab_consume_factor: .8,
		},

		room: {
			base: 1.5,
			image_factor: .25,
			durab_fix: 10,
			durab_factor: .75,
			durab_consume_factor: 2,
			auto_factor: 2,
			auto_power_consume: 100,
			auto_money_consume: 100,
			durab_threshold: 5000,
			durab_increase_factor: .2,
			durab_terminal_factor: .5,

			type_increase_factor: 2,
			type_normal_factor: 1,
			type_decrease_factor: .5,
		},

		factory: {
			image_increse_base: 10,
			image_increse_factor: .33,
			rrp_factor: .2,
			rrp_fix: 100,
			image_hrp_factor: 8,
			hrp_factor: .2,
			hrp_fix: 20,
		},

		relation: {
			support_decrease_fix: 250,
			support_increase_fix: 15,
			support_joint_increase_factor: .5,
			support_trade_increase_factor: .4,
			image_decrease_fix: 50,
			image_decrease_factor_range: [.2,.8,1,1.5,2,2.5,3],
			image_decrease_consume_fix: 1000,
			joint_image_threshold: 3000,
		},

        max_worker_ability: 100, // 人员最高能力值
		period: 10, // 市场清空周期
    }
}
/*
worker = {
	id: 1,
	tid: 1,
	rid: 1,
	rname: '', // 房间名
	fid: 1,
	fname: '', // 工厂名
	tfid: 1, // 外部对接工厂ID
	tfname: '', // 外部对接工厂名
	name: '',
	str: 1,(1-100)
	int: 1,
	com: 1,
	img: 1,
	boss: true, // 是老板
	job: 0, // [0:待命|
				1:终端发电|2:终端挖矿|3:终端交易|4:终端维护|
				5:房间自动化|6:房间维护|7:房间管理|8:房间门面|
				9:人力搜索|10:房间搜索|11:形象总代言人|
				12:外交||13:卧底]
}

terminal = {
	id: 1,
	rid: 1,
	fid: 1,
	durab: 100,(1-10000)
	powerLevel: 1,(1-3)
	digLevel: 1,(1-3)
	tradeLevel: 1,(1-3)
}

room = {
	id: 1,
	fid: 1,
	fname: '', // 工厂名
	name: '',
	power: 0,
	type: 1, // 房间类型[0:：通用间|1：发电站|2：挖矿厂|3：交易所]
	basicImage: 1,(0-120) // 基础形象
	durab: 1000,(1-10000)
	risk: 1,(1-3)
	auto: 1500,(1-10000)
	level: 1,(1-3)
}

factory = {
	id: 1,
	name: '',
	money: 50,
	image: 15,
	hrp: 0, // 人力搜索点数
	rrp: 0, // 房间搜索点数
	damaged: false, // 当前回合已经接受过一次打压
}

relation = {
	from: 1,
	fromName: '',
	to: 2,
	toName: '',
	invest: 0, // 投资$
	support: 0, // 支持率(0-10000)
}



























*/
